Revit 2027 API
ParameterTypeId.RebarShapeCrankStartStraightLength Property
 "Start Crank Straight Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeCrankStartStraightLength { get; }
Public Shared ReadOnly Property RebarShapeCrankStartStraightLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeCrankStartStraightLength {
	ForgeTypeId^ get ();
}
static member RebarShapeCrankStartStraightLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace